backend/ultimate-load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    # Phase 1: Warm up (2 minutes)
    - duration: 120
      arrivalRate: 5
      name: "Warm up"
    
    # Phase 2: Ramp to 500 users (3 minutes)
    - duration: 180
      arrivalRate: 5
      rampTo: 50
      name: "Ramp to 500 users"
    
    # Phase 3: Hold at 500 (2 minutes)
    - duration: 120
      arrivalRate: 50
      name: "Sustain 500 users"
    
    # Phase 4: Ramp to 1000 users (3 minutes)
    - duration: 180
      arrivalRate: 50
      rampTo: 100
      name: "Ramp to 1000 users"
    
    # Phase 5: Hold at 1000 (2 minutes)
    - duration: 120
      arrivalRate: 100
      name: "Sustain 1000 users"
    
    # Phase 6: Ramp to 2500 users (4 minutes)
    - duration: 240
      arrivalRate: 100
      rampTo: 250
      name: "Ramp to 2500 users"
    
    # Phase 7: Hold at 2500 (3 minutes)
    - duration: 180
      arrivalRate: 250
      name: "Sustain 2500 users"
    
    # Phase 8: Ramp to 5000 users (5 minutes)
    - duration: 300
      arrivalRate: 250
      rampTo: 500
      name: "Ramp to 5000 users"
    
    # Phase 9: Hold at 5000 (3 minutes)
    - duration: 180
      arrivalRate: 500
      name: "Sustain 5000 users"
    
    # Phase 10: Max out - ramp to 10000 (5 minutes)
    - duration: 300
      arrivalRate: 500
      rampTo: 1000
      name: "Ramp to 10000 users"
    
    # Phase 11: Hold max (2 minutes or until failure)
    - duration: 120
      arrivalRate: 1000
      name: "Sustain max load"
  
  engines:
    socketio-v3:
      path: "/socket.io"
      transports: ["websocket"]
  
  processor: "./ultimate-load-processor.js"

scenarios:
  - name: "Real user simulation"
    engine: socketio-v3
    flow:
      - function: "setupUser"
      - loop:
        - think: 2
        - emit:
            channel: "typing_start"
            data:
              receiverUsername: "{{ targetUser }}"
              username: "{{ username }}"
        - think: 1
        - emit:
            channel: "typing_stop"
            data:
              receiverUsername: "{{ targetUser }}"
              username: "{{ username }}"
        - think: 3
        - emit:
            channel: "send_message"
            data:
              receiverUsername: "{{ targetUser }}"
              content: "Load test message from {{ username }} at {{ timestamp }}"
              type: "text"
        - think: 5
        count: 5  # Each user sends 5 messages